app/models/article.rb

INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "asdf"], ["created_at", "2020-05-07 12:27:43.097492"], ["updated_at", "2020-05-07 12:27:43.097492"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = ? LIMIT ?  [["name", "adfasdf"], ["LIMIT", 1]]
---
  def tag_list=(tags_string)
    tag_names = tags_string.split(',').collect { |s| s.strip.downcase }.uniq
    new_or_found_tags = tag_names.collect { |name| Tag.find_or_create_by(name: name) }